'''

Вам дана последовательность измерений некоторой величины. Требуется определить, повторялась ли какое-либо число, причём расстояние между повторами не превосходило k.

Формат ввода
В первой строке задаются два числа n и k (1 ≤ n, k ≤ 105).

Во второй строке задаются n чисел, по модулю не превосходящих 109.

Формат вывода
Выведите YES, если найдется повторяющееся число и расстояние между повторами не превосходит k и NO в противном случае.

Пример 1
Ввод	Вывод
4 2
1 2 3 1
NO
Пример 2
Ввод	Вывод
4 1
1 0 1 1
YES
Пример 3
Ввод	Вывод
6 2
1 2 3 1 2 3
NO

'''

print('\n----DONE-----\n')


# n, k = 4, 2
# lst = [1, 2, 3, 1]
# NO
# n, k = 4, 1
# lst = [1, 0, 1, 1]
# YES
# 6 2
# 1 2 3 1 2 3
# NO


# print(n, k)
# print(lst)
# print('')

n, k = map(int, input().split())
lst = list(map(int, input().split()))

answer = False
d = {}

if n > 1 and lst[0] == lst[1]:
    answer = True
else:
    for i, v in enumerate(lst):
        if v in d:
            if i - d[v] <= k:
                answer = True
                break
        d[v] = i

if answer:
    print('YES')
else:
    print('NO')