'''

Ограничение времени	1 секунда
Ограничение памяти	64Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
Вам даны три списка чисел. Найдите все числа, которые встречаются хотя бы в двух из трёх списков.

Формат ввода
Во входных данных описывается три списка чисел. Первая строка каждого описания списка состоит из длины списка n (1 ≤ n ≤ 1000). Вторая строка описания содержит список натуральных чисел, записанных через пробел. Числа не превосходят 109.

Формат вывода
Выведите все числа, которые содержатся хотя бы в двух списках из трёх, в порядке возрастания. Обратите внимание, что каждое число необходимо выводить только один раз.

Пример 1
Ввод	Вывод
2
3 1
2
1 3
2
1 2
1 3
Пример 2
Ввод	Вывод
3
1 2 2
3
3 4 3
1
5

'''

print('----DONE-----')

n1 = int(input())
set1 = set(map(int, input().split()))
n2 = int(input())
set2 = set(map(int, input().split()))
n3 = int(input())
set3 = set(map(int, input().split()))

sets = [set1, set2, set3]
d = {}

for i in sets:
    for j in i:
        if j in d:
            d[j] += 1
        else:
            d[j] = 1

print(d)

answer = []
for k, v in d.items():
    if v >= 2:
        answer.append(k)

print(*sorted(answer))
