# Примеры использования создания списка и преобразования объектов к типу list:
list()
# Создание списка
# []
print([])
# []
print([1, 'a', 10, 'b', '105'])
# [1, 'a', 10, 'b', '105']


# Преобразование строки str в список тип list
list('abc')
# ['a',' b',' c']

# Преобразование кортежа tuple в список тип list
list((1, 2, 3))
# [1, 2, 3]

# Преобразование множества set в список тип list
list({1, 2, 3})
# [1, 2, 3]

# Преобразование генератора в список тип list
list(range(5))
# [0, 1, 2, 3, 4]

# Преобразуем список строк в список чисел
x = ['55', '11', '25', '15', '9']
int_list = [int(i) for i in x]
print(int_list)
# [11, 15, 25, 55, 9]

# SMTH

y = []
print(y)
for i in x:
    y.append(i)
print(y)



