# Примеры использования создания строк и преобразования объектов к типу str:
print('позволяет вставлять "двойные" кавычки')
# 'позволяет вставлять "двойные" кавычки'
print("позволяет использовать встроенные 'одинарные' кавычки")
# "позволяет использовать встроенные 'одинарные' кавычки"
print('''три одинарные кавычки''')
# 'три одинарные кавычки'
print("""три двойные кавычки""")
# 'три двойные кавычки'
print('''"двойные кавычки" и 'одинарные кавычки' в строке с тройными кавычками''')
# '"двойные кавычки" и \'одинарные кавычки\' в строке с тройными кавычками'

# преобразование объекта к строке
# получим читаемое значение объекта
print(str(65))
# '65'
print(str(65.20))
# '65.2'
print(str([1, 6, 3, 5]))
# '[1, 6, 3, 5]'
