'''

E. Прибыльный стартап
Ограничение времени	1 секунда
Ограничение памяти	256Mb
Ввод	стандартный ввод или input.txt
Вывод	стандартный вывод или output.txt
k
 друзей организовали стартап по производству укулеле для кошек. На сегодняшний день прибыль составила
n
 рублей. Вы, как главный бухгалтер компании, хотите в каждый из ближайших
d
 дней приписывать по одной цифре в конец числа, выражающего прибыль. При этом в каждый из дней прибыль должна делиться на
k
.
Формат ввода
В единственной строке входных данных через пробел записаны три числа:
n
,
k
,
d
 — изначальная прибыль, количество учредителей компании и количество дней, которое вы собираетесь следить за прибылью
(
1
≤
n
,
k
≤
1
0
9
,
1
≤
d
≤
1
0
5
)
. НЕ гарантируется, что
n
 делится на
k
.
Формат вывода
Выведите одно целое число
x
 — прибыль компании через
d
 дней. Первые цифры числа
x
 должны совпадать с числом
n
. Все префиксы числа
x
, которые длиннее числа
n
 на
1
,
2
,
…
,
d
 цифр, должны делиться на
k
. Если возможных ответов несколько, выведите любой из них. Если ответа не существует, выведите
−
1
.
Пример 1
Ввод	Вывод
21 108 1
216

'''

# 3
# 5 7 2
# x+


# 2
# 4 -5
# +

# TEST
# 100000
# 000..0011...111


length = 3
nums = [5, 7, 2]

# ANSWER НЕЧЕТНОЕ ЧИСЛО

lenght = 3
d = {k: v for k, v in zip(range(lenght), nums)}

print(lenght)
print(d)

answer = ''

for k, v in d.items():
    if v % 2:
        pass





print('\n-------------------------')

length = 3
nums = '5 0 2'

x, z = nums[-3:].split()

x = int(x)
z = int(z)

asnwer = ''

print(nums)
print('LAST 2 NUMBERS', x, z)


if (x * z) % 2 == 0:
    print('\nx')
    print(f'EVEN > {x * z}')
if (x + z) % 2 != 0:
    print('\n+')
    print(f'ODD > {x + z}')


print('-------------------------')

n = 3
nums = '5 7 2'  #  2'

n = 2
nums = '4 -5'

asnwer = ''

if n == 2:
    q, w = map(int, nums.split())
    print(q, w)
    print(type(q), type(w))

    if (q * w) % 2 != 0:
        print(f'\n(q * w) % 2 = {(q * w) % 2}')
        print('\nx')
        print(f'EVEN > {x * z}')
        answer += '*'

    if (q + w) % 2 != 0:
        print(f'(q + w) % 2 = {(q + w) % 2}')
        print('\n+')
        print(f'ODD > {x + z}')
        answer += '+'

    print('\nANSWER:', answer)

else:
    q, w, e = map(int, nums[-5:].split())
    print(q, w, e)
    print(type(q), type(w), type(e))

