'''

k
 друзей организовали стартап по производству укулеле для кошек. На сегодняшний день прибыль составила
n
 рублей. Вы, как главный бухгалтер компании, хотите в каждый из ближайших
d
 дней приписывать по одной цифре в конец числа, выражающего прибыль. При этом в каждый из дней прибыль должна делиться на
k
.
Формат ввода
В единственной строке входных данных через пробел записаны три числа:
n
,
k
,
d
 — изначальная прибыль, количество учредителей компании и количество дней, которое вы собираетесь следить за прибылью
(
1
≤
n
,
k
≤
1
0
9
,
1
≤
d
≤
1
0
5
)
. НЕ гарантируется, что
n
 делится на
k
.
Формат вывода
Выведите одно целое число
x
 — прибыль компании через
d
 дней. Первые цифры числа
x
 должны совпадать с числом
n
. Все префиксы числа
x
, которые длиннее числа
n
 на
1
,
2
,
…
,
d
 цифр, должны делиться на
k
. Если возможных ответов несколько, выведите любой из них. Если ответа не существует, выведите
−
1
.
Пример 1
Ввод	Вывод
21 108 1
216
Пример 2
Ввод	Вывод
5 12 4
-1

'''

print('--------try understand the task...------')

n = '21'  # изначальная прибыль
k = '108'  # количество челов
d = '1'  # дни слежки

x = 216

# РЕШЕНИЕ
# 108*i = 21_
# 108 * 2 = 216

# РЕШЕНИЕ
# n + i % k

for i in range(10):
    if int(n + str(i)) % int(k) == 0:
        print(i)

for i in range(10):
    if int(n + str(i)) % int(k) == 0:
        n + str(i)

for day in range(int(d)):
    for i in range(10):
        if int(n + str(i)) % int(k) == 0:
            n += str(i)

print(n)

# TEST:
# 21 108 1 = 216
# 5 12 4 = -1
# 1 1 1 = 19
# 2 1 3 = 2900


print('------')

# n = '21'  # изначальная прибыль
# k = 108  # количество челов
# d = 3  # дни слежки

# x = 216



n, k, d = '5', 12, 4

# n, k, d = input(), int(input()), int(input())

pre_n = n

if k == 1:
    n += '9'
    d -= 1

for day in range(d):
    for i in range(11):
        if i == 10:
            break

        if int(n + str(i)) % int(k) == 0:
            # print(f'NUMS: {n, i}')
            n += str(i)
            break

if n != pre_n:
    print(n)
else:
    print(-1)


print('---need min complexity----')

# TEST:
# 21 108 1 = 216
# 5 12 4 = -1
# 1 1 1 = 19
# 2 1 3 = 2900

# РЕШЕНИЕ
# n + i % k


